# Brewfile - Homebrew 包清单
# 使用方法: brew bundle [--file=Brewfile]

# ===== 开发工具 =====
brew "git"
brew "git-lfs"
brew "gh"              # GitHub CLI
brew "go"              # Go 语言
brew "mercurial"       # Mercurial 版本控制
brew "wget"            # 下载工具

# ===== 版本管理器 =====
brew "fnm"             # Fast Node Manager
brew "rbenv"           # Ruby 版本管理
brew "jenv"            # Java 版本管理

# ===== 移动开发 =====
brew "cocoapods"       # iOS 依赖管理
brew "carthage"        # iOS 依赖管理
brew "ideviceinstaller"
brew "ios-deploy"
brew "dart-lang/dart/dart"
brew "befovy/taps/fvm" # Flutter Version Manager
brew "xcodegen"        # Xcode 项目生成工具

# ===== 命令行增强 =====
brew "fzf"             # 模糊查找工具
brew "fd"              # 更好的 find 命令
brew "tree"            # 目录树显示
brew "tmux"            # 终端复用器
brew "thefuck"         # 命令纠错工具
brew "autocorrect"     # 自动纠错
brew "ast-grep"        # AST 代码搜索和替换

# ===== 构建工具 =====
brew "automake"
brew "libtool"
brew "swiftlint"       # Swift 代码检查
brew "typst"           # 排版工具
brew "uv"              # Python 包管理器

# ===== 容器和云 =====
brew "podman"          # 容器管理
brew "kind"            # Kubernetes in Docker
brew "mosquitto"       # MQTT 消息代理
brew "redis"           # 缓存数据库

# ===== 文档和媒体 =====
brew "pandoc"          # 文档转换工具
brew "ffmpeg"          # 视频处理
brew "markdownlint-cli" # Markdown 检查

# ===== AI 和自动化 =====
brew "gemini-cli"      # Google Gemini CLI
brew "opencode"        # 代码工具

# ===== Dotfiles 管理 =====
brew "chezmoi"         # Dotfiles 管理工具

# ===== Java =====
brew "openjdk@17"

# ===== Tap 仓库 =====
tap "homebrew/cask-fonts"
tap "befovy/taps"
tap "dart-lang/dart"

# ===== Cask 应用 (GUI 应用) =====
cask "devtoys"                    # 开发工具箱
cask "font-smiley-sans"           # 思源黑体字体
cask "mactex"                     # MacTeX LaTeX 发行版
cask "openinterminal"             # 在当前目录打开终端
cask "piclist"                    # 图床工具
cask "xquartz"                    # X11 窗口系统
