# Brewfile - 通用 Homebrew 包清单（所有平台）
# 使用方法: brew bundle [--file=Brewfile]

# ===== 基础开发工具 =====
brew "git"             # 版本控制
brew "git-lfs"         # Git 大文件存储
brew "gh"              # GitHub CLI
brew "go"              # Go 语言
brew "mercurial"       # Mercurial 版本控制
brew "wget"            # 下载工具
brew "jq"              # JSON 处理工具
brew "sevenzip"        # 7z 压缩工具

# ===== 版本管理器 =====
brew "rbenv"           # Ruby 版本管理
brew "jenv"            # Java 版本管理
brew "nvm"             # Node.js 
brew "ni"              # Node.js 包管理器

# ===== 命令行增强 =====
brew "fzf"             # 模糊查找工具
brew "fd"              # 更好的 find 命令
brew "ripgrep"         # 更好的 grep 命令
brew "bat"             # 更好的 cat 命令
brew "eza"             # 更好的 ls 命令
brew "zoxide"          # 智能目录跳转
brew "autojump"        # 智能目录跳转
brew "tree"            # 目录树显示
brew "tmux"            # 终端复用器
brew "thefuck"         # 命令纠错工具
brew "autocorrect"     # 自动纠错
brew "ast-grep"        # AST 代码搜索和替换
brew "cloudflare-wrangler"  # Cloudflare Workers CLI
brew "llm"             # LLM 命令行工具
brew "tldr"            # 命令行简明帮助
brew "opencode"        # OpenCode CLI

# ===== Linter =====
brew "just"            # 命令任务自动化
brew "pre-commit"      # Git pre-commit 框架
brew "markdownlint-cli2"  # Markdown lint + 自动修复
brew "shellcheck"      # Shell 脚本静态检查
brew "shfmt"           # Shell 脚本格式化
brew "pyrefly"

# ===== 编辑器 =====
brew "neovim"          # 现代化 Vim 编辑器
brew "lazygit"         # Git TUI 工具
brew "yazi"            # 终端文件管理器

# ===== 构建工具 =====
brew "automake"
brew "libtool"
brew "uv"              # Python 包管理器

# ===== 文档和媒体 =====
brew "pandoc"          # 文档转换工具
brew "ffmpeg"          # 视频处理
brew "poppler"         # PDF 处理库
brew "librsvg"         # SVG 渲染库
brew "resvg"           # SVG 渲染工具
brew "imagemagick"     # 图像处理工具
cask "font-symbols-only-nerd-font"  # 符号 Nerd Font
cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono Nerd Font

# ===== Dotfiles 管理 =====
brew "chezmoi"         # Dotfiles 管理工具
