# brew bundle --file=Brewfile.linux

# ===== 开发工具 =====
brew "git"
brew "git-lfs"
brew "gh"              # GitHub CLI
brew "go"              # Go 语言
brew "mercurial"       # Mercurial 版本控制
brew "wget"            # 下载工具
brew "jq"              # JSON 处理工具
brew "sevenzip"        # 7z 压缩工具

# ===== 版本管理器 =====
brew "fnm"             # Fast Node Manager
brew "rbenv"           # Ruby 版本管理
brew "jenv"            # Java 版本管理

# ===== 命令行增强 =====
brew "fzf"             # 模糊查找工具
brew "fd"              # 更好的 find 命令
brew "ripgrep"         # 更好的 grep 命令
brew "bat"             # 更好的 cat 命令
brew "eza"             # 更好的 ls 命令
brew "zoxide"          # 智能目录跳转
brew "tree"            # 目录树显示
brew "tmux"            # 终端复用器
brew "thefuck"         # 命令纠错工具
brew "autocorrect"     # 自动纠错
brew "ast-grep"        # AST 代码搜索和替换

# ===== 编辑器 =====
brew "neovim"          # 现代化 Vim 编辑器
brew "lazygit"         # Git TUI 工具
brew "yazi"            # 终端文件管理器

# ===== 构建工具 =====
brew "automake"
brew "libtool"
brew "uv"              # Python 包管理器

# ===== 文档和媒体 =====
brew "pandoc"          # 文档转换工具
brew "ffmpeg"          # 视频处理
brew "poppler"         # PDF 处理库
brew "resvg"           # SVG 渲染工具
brew "imagemagick"     # 图像处理工具

# ===== AI 和自动化 =====
brew "gemini-cli"      # Google Gemini CLI
brew "opencode"        # 代码工具

# ===== Dotfiles 管理 =====
brew "chezmoi"         # Dotfiles 管理工具

# ===== 字体 =====
cask "font-symbols-only-nerd-font"  # 符号 Nerd Font
